zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT798S/drivers/fsl_clock.h
/*! @brief Clock ip name array for ACMP. */
#define CMP_CLOCKS   \
    {                \
        kCLOCK_Acmp0 \
    }

/*! @brief Clock ip name array for uSDHC */
#define USDHC_CLOCKS                 \
    {                                \
        kCLOCK_Usdhc0, kCLOCK_Usdhc1 \
    }

/*! @brief Clock ip name array for WWDT. */
#define WWDT_CLOCKS                                            \
    {                                                          \
        kCLOCK_Wwdt0, kCLOCK_Wwdt1, kCLOCK_Wwdt2, kCLOCK_Wwdt3 \
    }

/*! @brief Clock ip name array for UTICK. */
#define UTICK_CLOCKS                 \
    {                                \
        kCLOCK_Utick0, kCLOCK_Utick1 \
    }

/*! @brief Clock ip name array for FlexIO. */
#define FLEXIO_CLOCKS \
    {                 \
        kCLOCK_Flexio \
    }

/*! @brief Clock ip name array for LP_FLEXCOMM. */
#define LP_FLEXCOMM_CLOCKS                                                                                        \
    {                                                                                                             \
        kCLOCK_LPFlexComm0, kCLOCK_LPFlexComm1, kCLOCK_LPFlexComm2, kCLOCK_LPFlexComm3, kCLOCK_LPFlexComm4,       \
            kCLOCK_LPFlexComm5, kCLOCK_LPFlexComm6, kCLOCK_LPFlexComm7, kCLOCK_LPFlexComm8, kCLOCK_LPFlexComm9,   \
            kCLOCK_LPFlexComm10, kCLOCK_LPFlexComm11, kCLOCK_LPFlexComm12, kCLOCK_LPFlexComm13, kCLOCK_IpInvalid, \
            kCLOCK_IpInvalid, kCLOCK_IpInvalid, kCLOCK_LPFlexComm17, kCLOCK_LPFlexComm18, kCLOCK_LPFlexComm19,    \
            kCLOCK_LPFlexComm20                                                                                   \
    }
/*! @brief Clock ip name array for LPUART. */
#define LPUART_CLOCKS                                                                                                \
    {                                                                                                                \
        kCLOCK_LPUart0, kCLOCK_LPUart1, kCLOCK_LPUart2, kCLOCK_LPUart3, kCLOCK_LPUart4, kCLOCK_LPUart5,              \
            kCLOCK_LPUart6, kCLOCK_LPUart7, kCLOCK_LPUart8, kCLOCK_LPUart9, kCLOCK_LPUart10, kCLOCK_LPUart11,        \
            kCLOCK_LPUart12, kCLOCK_LPUart13, kCLOCK_IpInvalid, kCLOCK_IpInvalid, kCLOCK_IpInvalid, kCLOCK_LPUart17, \
            kCLOCK_LPUart18, kCLOCK_LPUart19, kCLOCK_LPUart20                                                        \
    }
/*! @brief Clock ip name array for LPI2C. */
#define LPI2C_CLOCKS                                                                                             \
    {                                                                                                            \
        kCLOCK_LPI2c0, kCLOCK_LPI2c1, kCLOCK_LPI2c2, kCLOCK_LPI2c3, kCLOCK_LPI2c4, kCLOCK_LPI2c5, kCLOCK_LPI2c6, \
            kCLOCK_LPI2c7, kCLOCK_LPI2c8, kCLOCK_LPI2c9, kCLOCK_LPI2c10, kCLOCK_LPI2c11, kCLOCK_LPI2c12,         \
            kCLOCK_LPI2c13, kCLOCK_IpInvalid, kCLOCK_LPI2c15, kCLOCK_IpInvalid, kCLOCK_LPI2c17, kCLOCK_LPI2c18,  \
            kCLOCK_LPI2c19, kCLOCK_LPI2c20                                                                       \
    }
/*! @brief Clock ip name array for LSPI. */
#define LPSPI_CLOCKS                                                                                             \
    {                                                                                                            \
        kCLOCK_LPSpi0, kCLOCK_LPSpi1, kCLOCK_LPSpi2, kCLOCK_LPSpi3, kCLOCK_LPSpi4, kCLOCK_LPSpi5, kCLOCK_LPSpi6, \
            kCLOCK_LPSpi7, kCLOCK_LPSpi8, kCLOCK_LPSpi9, kCLOCK_LPSpi10, kCLOCK_LPSpi11, kCLOCK_LPSpi12,         \
            kCLOCK_LPSpi13, kCLOCK_LPSpi14, kCLOCK_IpInvalid, kCLOCK_LPSpi16, kCLOCK_LPSpi17, kCLOCK_LPSpi18,    \
            kCLOCK_LPSpi19, kCLOCK_LPSpi20                                                                       \
    }
/*! @brief Clock ip name array for SAI. */
#define SAI_CLOCKS                                         \
    {                                                      \
        kCLOCK_Sai0, kCLOCK_Sai1, kCLOCK_Sai2, kCLOCK_Sai3 \
    }

/*! @brief Clock ip name array for SEMA */
#define SEMA42_CLOCKS                                                                      \
    {                                                                                      \
        kCLOCK_Sema420, kCLOCK_IpInvalid, kCLOCK_IpInvalid, kCLOCK_Sema423, kCLOCK_Sema424 \
    }

/*! @brief Clock ip name array for MU */
#if defined(FSL_CLOCK_DRIVER_COMPUTE) || defined(FSL_CLOCK_DRIVER_MEDIA)
#ifndef __XTENSA__
#define MU_CLOCKS                          \
    {                                      \
        kCLOCK_Mu0, kCLOCK_Mu1, kCLOCK_Mu4 \
    }
#else
#define MU_CLOCKS              \
    {                          \
        kCLOCK_Mu2, kCLOCK_Mu4 \
    }
#endif /* __XTENSA__ */

/*! @brief Clock ip name array for DMA. */
#define EDMA_CLOCKS              \
    {                            \
        kCLOCK_Dma0, kCLOCK_Dma1 \
    }

/*! @brief Clock ip name array for SYSPM. */
#define SYSPM_CLOCKS                                                     \
    {                                                                    \
        kCLOCK_Syspm0, kCLOCK_Syspm1, kCLOCK_IpInvalid, kCLOCK_IpInvalid \
    }

/*! @brief Clock ip name array for TRNG. */
#define TRNG_CLOCKS    \
    {                  \
        kCLOCK_TrngRef \
    }

#if defined(FSL_CLOCK_DRIVER_MEDIA)
/*! @brief Clock ip name array for INPUTMUX. */
#define INPUTMUX_CLOCKS                    \
    {                                      \
        kCLOCK_InputMux0, kCLOCK_InputMux1 \
    }
#else
#define INPUTMUX_CLOCKS  \
    {                    \
        kCLOCK_InputMux0 \
    }
#endif /* FSL_CLOCK_DRIVER_MEDIA */

#endif /* FSL_CLOCK_DRIVER_COMPUTE || FSL_CLOCK_DRIVER_MEDIA */

#if defined(FSL_CLOCK_DRIVER_SENSE)
#ifndef __XTENSA__
#define MU_CLOCKS                          \
    {                                      \
        kCLOCK_Mu1, kCLOCK_Mu2, kCLOCK_Mu3 \
    }
#else
#define MU_CLOCKS              \
    {                          \
        kCLOCK_Mu0, kCLOCK_Mu3 \
    }
#endif /* __XTENSA__ */

/*! @brief Clock ip name array for DMA. */
#define EDMA_CLOCKS              \
    {                            \
        kCLOCK_Dma2, kCLOCK_Dma3 \
    }

/*! @brief Clock ip name array for INPUTMUX. */
#define INPUTMUX_CLOCKS  \
    {                    \
        kCLOCK_InputMux1 \
    }
#endif /* FSL_CLOCK_DRIVER_SENSE */

/*! @brief Clock ip name array for CRC. */
#define CRC_CLOCKS  \
    {               \
        kCLOCK_Crc0 \
    }

