zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT798S/drivers/fsl_clock.h
#if defined(FSL_CLOCK_DRIVER_COMPUTE) || defined(FSL_CLOCK_DRIVER_MEDIA)
/*! @brief Clock ip name array for GDET. */
#define GDET_CLOCKS                                                    \
    {                                                                  \
        kCLOCK_Gdet0, kCLOCK_IpInvalid, kCLOCK_IpInvalid, kCLOCK_Gdet3 \
    }

/*! @brief Clock ip name array for GDET_REF. */
#define GDET_REF_CLOCKS                                                      \
    {                                                                        \
        kCLOCK_Gdet0Ref, kCLOCK_IpInvalid, kCLOCK_IpInvalid, kCLOCK_Gdet3Ref \
    }
#endif
#if defined(FSL_CLOCK_DRIVER_SENSE)
/*! @brief Clock ip name array for GDET. */
#define GDET_CLOCKS                                                        \
    {                                                                      \
        kCLOCK_IpInvalid, kCLOCK_IpInvalid, kCLOCK_IpInvalid, kCLOCK_Gdet3 \
    }

/*! @brief Clock ip name array for GDET_REF. */
#define GDET_REF_CLOCKS                                                       \
    {                                                                         \
        kCLOCK_IpInvalid, kCLOCK_IpInvalid, kCLOCK_IpInvalid, kCLOCK_Gdet3Ref \
    }
#endif

/*! @brief Clock ip name array for GPIO. */
#define GPIO_CLOCKS                                                                                            \
    {                                                                                                          \
        kCLOCK_Gpio0, kCLOCK_Gpio1, kCLOCK_Gpio2, kCLOCK_Gpio3, kCLOCK_Gpio4, kCLOCK_Gpio5, kCLOCK_Gpio6,      \
            kCLOCK_Gpio7, kCLOCK_Gpio8, kCLOCK_Gpio9, kCLOCK_Gpio10, kCLOCK_Gpio0, kCLOCK_Gpio1, kCLOCK_Gpio2, \
            kCLOCK_Gpio3, kCLOCK_Gpio4, kCLOCK_Gpio5, kCLOCK_Gpio6, kCLOCK_Gpio7, kCLOCK_Gpio8, kCLOCK_Gpio9,  \
            kCLOCK_Gpio10                                                                                      \
    }

/*! @brief Clock ip name array for PDM. */
#define PDM_CLOCKS \
    {              \
        kCLOCK_Pdm \
    }

/*! @brief Clock ip name array for PINT. */
#define PINT_CLOCKS \
    {               \
        kCLOCK_Pint \
    }

/*! @brief Clock ip name array for PNGDEC. */
#define PNGDEC_CLOCKS     \
    {                     \
        kCLOCK_PngDecoder \
    }

/*! @brief Clock ip name array for JPEGDEC. */
#define JPEGDEC_CLOCKS    \
    {                     \
        kCLOCK_JpgDecoder \
    }

/*! @brief Clock ip name array for I3C. */
#define I3C_CLOCKS                                         \
    {                                                      \
        kCLOCK_I3c0, kCLOCK_I3c1, kCLOCK_I3c2, kCLOCK_I3c3 \
    }

/*! @brief Clock ip name array for MRT. */
#define MRT_CLOCKS               \
    {                            \
        kCLOCK_Mrt0, kCLOCK_Mrt1 \
    }

/*! @brief Clock ip name array for CT32B. */
#define CTIMER_CLOCKS                                                                                            \
    {                                                                                                            \
        kCLOCK_Ct32b0, kCLOCK_Ct32b1, kCLOCK_Ct32b2, kCLOCK_Ct32b3, kCLOCK_Ct32b4, kCLOCK_Ct32b5, kCLOCK_Ct32b6, \
            kCLOCK_Ct32b7                                                                                        \
    }

/*! @brief Clock ip name array for OSTIMER. */
#define OSTIMER_CLOCKS \
    {                  \
        kCLOCK_OsTimer \
    }

/*! @brief Clock ip name array for RTC. */
#define RTC_CLOCKS \
    {              \
        kCLOCK_Rtc \
    }

/*! @brief Clock gate name used for CLOCK_EnableClock/CLOCK_DisableClock. */
/*------------------------------------------------------------------------------
 clock_ip_name_t definition:
------------------------------------------------------------------------------*/
#define CLK_GATE_REG_OFFSET_SHIFT 8U
#define CLK_GATE_REG_OFFSET_MASK  0xFF00U
#define CLK_GATE_BIT_SHIFT_SHIFT  0U
#define CLK_GATE_BIT_SHIFT_MASK   0x00FFU

#define CLK_GATE_DEFINE(reg_offset, bit_shift)                                  \
    ((((reg_offset) << CLK_GATE_REG_OFFSET_SHIFT) & CLK_GATE_REG_OFFSET_MASK) | \
     (((bit_shift) << CLK_GATE_BIT_SHIFT_SHIFT) & CLK_GATE_BIT_SHIFT_MASK))

#define CLK_GATE_ABSTRACT_REG_OFFSET(x) (((uint32_t)(x) & CLK_GATE_REG_OFFSET_MASK) >> CLK_GATE_REG_OFFSET_SHIFT)
#define CLK_GATE_ABSTRACT_BITS_SHIFT(x) (((uint32_t)(x) & CLK_GATE_BIT_SHIFT_MASK) >> CLK_GATE_BIT_SHIFT_SHIFT)

#define CLK_CTL0_PSCCTL0 0 /* CLKCTL_COM_VDD2 PSCCTL0 */
#define CLK_CTL0_PSCCTL1 1
#define CLK_CTL0_PSCCTL2 2
#define CLK_CTL0_PSCCTL3 3
#define CLK_CTL0_PSCCTL4 4
#define CLK_CTL0_PSCCTL5 5
#define CLK_CTL1_PSCCTL0 6  /* CLKCTL_VDD1_SENSE PSCCTL0 */
#define CLK_CTL1_PSCCTL1 7
#define CLK_CTL2_PSCCTL0 8  /* CLKCTL_VDD1_COM PSCCTL0 */
#define CLK_CTL3_PSCCTL0 9  /* CLKCTL2 PSCCTL0 */
#define CLK_CTL4_PSCCTL0 10 /* CLKCTL_MED_VDD2 PSCCTL0 */
#define CLK_CTL4_PSCCTL1 11 /* CLKCTL_MED_VDD2 PSCCTL1 */
#if defined(FSL_CLOCK_DRIVER_COMPUTE) || defined(FSL_CLOCK_DRIVER_MEDIA) || defined(FSL_CLOCK_DRIVER_MEDIA)
#define SYSCON0_SEC_CLK_CTRL 12
#endif
#define SYSCON3_SEC_CLK_CTRL            13
#define CLKCTL0_ONE_SRC_CLKSLICE_ENABLE 14
#define CLKCTL3_ONE_SRC_CLKSLICE_ENABLE 15
#define CLKCTL4_ONE_SRC_CLKSLICE_ENABLE 16

/*! @brief USB clock source definition. */
typedef enum _clock_usb_src
{
    kCLOCK_Usb480M      = 0,                /*!< Use 480M.      */
    kCLOCK_UsbSrcUnused = (int)0xFFFFFFFFU, /*!< Used when the function does not
                                            care the clock source. */
} clock_usb_src_t;

/*! @brief Source of the USB HS PHY. */
typedef enum _clock_usb_phy_src
{
    kCLOCK_Usbphy480M = 0, /*!< Use 480M.      */
} clock_usb_phy_src_t;

/*! @brief Clock gate name used for CLOCK_EnableClock/CLOCK_DisableClock. */
typedef enum _clock_ip_name
{
    kCLOCK_IpInvalid = 0U,                                         /*!< Invalid Ip Name. */

    kCLOCK_Xcache1   = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL0, 1),       /*!< Clock gate name: Code cache*/
    kCLOCK_Xcache0   = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL0, 2),       /*!< Clock gate name: System cache*/
    kCLOCK_Ocotp0    = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL0, 5),       /*!< Clock gate name: VDD2 OTP0*/
    kCLOCK_Sleepcon0 = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL0, 12),      /*!< Clock gate name: SLEEPCON_CMPT*/
    kCLOCK_Syscon0   = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL0, 13),      /*!< Clock gate name: SYSCON_CMPT*/
    kCLOCK_Glikey0   = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL0, 14),      /*!< Clock gate name: GLIKEY0*/
    kCLOCK_Glikey3   = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL0, 15),      /*!< Clock gate name: GLIKEY3*/

    kCLOCK_TpiuTraceClkin = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 2),  /*!< Clock gate name: TPIU_TRACECLKIN*/
    kCLOCK_SWOTraceClkin  = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 3),  /*!< Clock gate name: SWO_TRACECLKIN*/
    kCLOCK_Tsclk          = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 4),  /*!< Clock gate name: TRACE*/
    kCLOCK_Dma0           = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 5),  /*!< Clock gate name: DMA0*/
    kCLOCK_Dma1           = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 6),  /*!< Clock gate name: DMA1*/
    kCLOCK_PkcRam         = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 7),  /*!< Clock gate name: PKC RAM */
    kCLOCK_Pkc            = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 8),  /*!< Clock gate name: PKC*/
    kCLOCK_Romcp          = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 9),  /*!< Clock gate name: ROMCP*/
    kCLOCK_Xspi0          = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 10), /*!< Clock gate name: XSPI0*/
    kCLOCK_Xspi1          = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 11), /*!< Clock gate name: XSPI1*/
    kCLOCK_Cache64ctrl0   = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 12), /*!< Clock gate name: CACHE64_0*/
    kCLOCK_Cache64ctrl1   = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 13), /*!< Clock gate name: CACHE64_1*/
    kCLOCK_Puf            = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 14), /*!< Clock gate name: QK_SUBSYS*/
    kCLOCK_Mmu0           = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 16), /*!< Clock gate name: MMU0*/
    kCLOCK_Mmu1           = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 17), /*!< Clock gate name: MMU1*/
    kCLOCK_Gpio0          = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 18), /*!< Clock gate name: GPIO0*/
    kCLOCK_Gpio1          = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 19), /*!< Clock gate name: GPIO1*/
    kCLOCK_Gpio2          = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 20), /*!< Clock gate name: GPIO2*/
    kCLOCK_Gpio3          = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 21), /*!< Clock gate name: GPIO3*/
    kCLOCK_Gpio4          = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 22), /*!< Clock gate name: GPIO4*/
    kCLOCK_Gpio5          = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 23), /*!< Clock gate name: GPIO5*/
    kCLOCK_Gpio6          = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 24), /*!< Clock gate name: GPIO6*/
    kCLOCK_Gpio7          = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 25), /*!< Clock gate name: GPIO7*/
    kCLOCK_Sct0           = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 26), /*!< Clock gate name: SCT0*/
    kCLOCK_Cdog0          = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 27), /*!< Clock gate name: CDOG0*/
    kCLOCK_Cdog1          = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 28), /*!< Clock gate name: CDOG1*/
    kCLOCK_Cdog2          = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 29), /*!< Clock gate name: CDOG2*/
    kCLOCK_LPFlexComm0    = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 30), /*!< Clock gate name: LP_Flexcomm0*/
    kCLOCK_LPFlexComm1    = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 31), /*!< Clock gate name: LP_Flexcomm1*/
    kCLOCK_LPUart0        = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 30), /*!< Clock gate name: LPUART0*/
    kCLOCK_LPUart1        = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 31), /*!< Clock gate name: LPUART1*/
    kCLOCK_LPI2c0         = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 30), /*!< Clock gate name: LPI2C0*/
    kCLOCK_LPI2c1         = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 31), /*!< Clock gate name: LPI2C1*/
    kCLOCK_LPSpi0         = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 30), /*!< Clock gate name: LPSPI0*/
    kCLOCK_LPSpi1         = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL1, 31), /*!< Clock gate name: LPSPI1*/
    kCLOCK_LPFlexComm2    = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 0),  /*!< Clock gate name: LP_Flexcomm2*/
    kCLOCK_LPFlexComm3    = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 1),  /*!< Clock gate name: LP_Flexcomm3*/
    kCLOCK_LPFlexComm4    = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 2),  /*!< Clock gate name: LP_Flexcomm4*/
    kCLOCK_LPFlexComm5    = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 3),  /*!< Clock gate name: LP_Flexcomm5*/
    kCLOCK_LPFlexComm6    = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 4),  /*!< Clock gate name: LP_Flexcomm6*/
    kCLOCK_LPFlexComm7    = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 5),  /*!< Clock gate name: LP_Flexcomm7*/
    kCLOCK_LPFlexComm8    = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 6),  /*!< Clock gate name: LP_Flexcomm8*/
    kCLOCK_LPFlexComm9    = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 7),  /*!< Clock gate name: LP_Flexcomm9*/
    kCLOCK_LPFlexComm10   = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 8),  /*!< Clock gate name: LP_Flexcomm10*/
    kCLOCK_LPFlexComm11   = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 9),  /*!< Clock gate name: LP_Flexcomm11*/
    kCLOCK_LPFlexComm12   = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 10), /*!< Clock gate name: LP_Flexcomm12*/
    kCLOCK_LPFlexComm13   = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 11), /*!< Clock gate name: LP_Flexcomm13*/
    kCLOCK_LPUart2        = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 0),  /*!< Clock gate name: LPUART2*/
    kCLOCK_LPUart3        = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 1),  /*!< Clock gate name: LPUART3*/
    kCLOCK_LPUart4        = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 2),  /*!< Clock gate name: LPUART4*/
    kCLOCK_LPUart5        = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 3),  /*!< Clock gate name: LPUART5*/
    kCLOCK_LPUart6        = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 4),  /*!< Clock gate name: LPUART6*/
    kCLOCK_LPUart7        = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 5),  /*!< Clock gate name: LPUART7*/
    kCLOCK_LPUart8        = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 6),  /*!< Clock gate name: LPUART8*/
    kCLOCK_LPUart9        = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 7),  /*!< Clock gate name: LPUART9*/
    kCLOCK_LPUart10       = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 8),  /*!< Clock gate name: LPUART10*/
    kCLOCK_LPUart11       = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 9),  /*!< Clock gate name: LPUART11*/
    kCLOCK_LPUart12       = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 10), /*!< Clock gate name: LPUART12*/
    kCLOCK_LPUart13       = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 11), /*!< Clock gate name: LPUART13*/
    kCLOCK_LPI2c2         = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 0),  /*!< Clock gate name: LPI2C2*/
    kCLOCK_LPI2c3         = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 1),  /*!< Clock gate name: LPI2C3*/
    kCLOCK_LPI2c4         = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 2),  /*!< Clock gate name: LPI2C4*/
    kCLOCK_LPI2c5         = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 3),  /*!< Clock gate name: LPI2C5*/
    kCLOCK_LPI2c6         = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 4),  /*!< Clock gate name: LPI2C6*/
    kCLOCK_LPI2c7         = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 5),  /*!< Clock gate name: LPI2C7*/
    kCLOCK_LPI2c8         = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 6),  /*!< Clock gate name: LPI2C8*/
    kCLOCK_LPI2c9         = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 7),  /*!< Clock gate name: LPI2C9*/
    kCLOCK_LPI2c10        = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 8),  /*!< Clock gate name: LPI2C10*/
    kCLOCK_LPI2c11        = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 9),  /*!< Clock gate name: LPI2C11*/
    kCLOCK_LPI2c12        = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 10), /*!< Clock gate name: LPI2C12*/
    kCLOCK_LPI2c13        = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 11), /*!< Clock gate name: LPI2C13*/
    kCLOCK_LPSpi2         = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 0),  /*!< Clock gate name: LPSPI2*/
    kCLOCK_LPSpi3         = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 1),  /*!< Clock gate name: LPSPI3*/
    kCLOCK_LPSpi4         = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 2),  /*!< Clock gate name: LPSPI4*/
    kCLOCK_LPSpi5         = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 3),  /*!< Clock gate name: LPSPI5*/
    kCLOCK_LPSpi6         = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 4),  /*!< Clock gate name: LPSPI6*/
    kCLOCK_LPSpi7         = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 5),  /*!< Clock gate name: LPSPI7*/
    kCLOCK_LPSpi8         = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 6),  /*!< Clock gate name: LPSPI8*/
    kCLOCK_LPSpi9         = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 7),  /*!< Clock gate name: LPSPI9*/
    kCLOCK_LPSpi10        = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 8),  /*!< Clock gate name: LPSPI10*/
    kCLOCK_LPSpi11        = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 9),  /*!< Clock gate name: LPSPI11*/
    kCLOCK_LPSpi12        = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 10), /*!< Clock gate name: LPSPI12*/
    kCLOCK_LPSpi13        = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 11), /*!< Clock gate name: LPSPI13*/
    kCLOCK_Sai0           = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 13), /*!< Clock gate name: SAI0*/
    kCLOCK_Sai1           = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 14), /*!< Clock gate name: SAI1*/
    kCLOCK_Sai2           = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 15), /*!< Clock gate name: SAI2*/
    kCLOCK_I3c0           = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 16), /*!< Clock gate name: I3C0*/
    kCLOCK_I3c1           = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 17), /*!< Clock gate name: I3C1*/
    kCLOCK_Crc0           = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 18), /*!< Clock gate name: CRC0*/
    kCLOCK_Wwdt0          = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 19), /*!< Clock gate name: WWDT0*/
    kCLOCK_Wwdt1          = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 20), /*!< Clock gate name: WWDT1*/
    kCLOCK_Ct32b0         = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 21), /*!< Clock gate name: CTIMER0*/
    kCLOCK_Ct32b1         = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 22), /*!< Clock gate name: CTIMER1*/
    kCLOCK_Ct32b2         = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 23), /*!< Clock gate name: CTIMER2*/
    kCLOCK_Ct32b3         = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 24), /*!< Clock gate name: CTIMER3*/
    kCLOCK_Ct32b4         = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 25), /*!< Clock gate name: CTIMER4*/
    kCLOCK_Mrt0           = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 26), /*!< Clock gate name: Mrt0*/
    kCLOCK_Utick0         = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 27), /*!< Clock gate name: Utick0*/
    kCLOCK_Sema424        = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 30), /*!< Clock gate name: SEMA42_4*/
    kCLOCK_Mu4            = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL2, 31), /*!< Clock gate name: MU4*/
    kCLOCK_Pint0          = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL3, 5),  /*!< Clock gate name: PINT0*/
    kCLOCK_Pvts0          = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL3, 6),  /*!< Clock gate name: PVTS0*/
    kCLOCK_InputMux0      = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL3, 10), /*!< Clock gate name: PMUX_CMPT_SPLITTER*/
    kCLOCK_Freqme0        = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL3, 8),  /*!< Clock gate name: FREQME0*/
    kCLOCK_SafoSgi        = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL3, 12), /*!< Clock gate name: SAFO_SGI*/
    kCLOCK_Trace          = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL3, 13), /*!< Clock gate name: TRACE*/
    kCLOCK_Prince0        = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL3, 15), /*!< Clock gate name: PRINCE0*/
    kCLOCK_Prince1        = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL3, 16), /*!< Clock gate name: PRINCE1*/
    kCLOCK_PrinceExe      = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL3, 17), /*!< Clock gate name: PRINCE_EXE*/
    kCLOCK_Syspm0         = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL3, 18), /*!< Clock gate name: CMX_PERFMON0*/
    kCLOCK_Syspm1         = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL3, 19), /*!< Clock gate name: CMX_PERFMON1*/
    kCLOCK_Hifi4          = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL4, 0),  /*!< Clock gate name: HIFI4*/
    kCLOCK_Npu0           = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL5, 0),  /*!< Clock gate name: NPU0*/
    kCLOCK_CompAccessRamArbiter1 =
        CLK_GATE_DEFINE(CLK_CTL0_PSCCTL5, 2),                      /*!< Clock gate name: COMP_ACCESS_RAM_ARBITER1*/
    kCLOCK_Iopctl0 = CLK_GATE_DEFINE(CLK_CTL0_PSCCTL5, 3),         /*!< Clock gate name: IOMUXC_VDD2*/
    kCLOCK_Hifi4AccessRamArbiter1 =
        CLK_GATE_DEFINE(CLK_CTL0_PSCCTL5, 4),                      /*!< Clock gate name: HIFI4_ACCESS_RAM_ARBITER1*/
    kCLOCK_MediaAccessRamArbiter0 =
        CLK_GATE_DEFINE(CLK_CTL0_PSCCTL5, 5),                      /*!< Clock gate name: MEDIA_ACCESS_RAM_ARBITER0*/

    kCLOCK_Sleepcon1 = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL0, 6),       /*!< Clock gate name: SLEEPCONCPU1*/
    kCLOCK_Syscon1   = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL0, 7),       /*!< Clock gate name: SYSCONSENSE1*/
    kCLOCK_SenseAccessRamArbiter0 =
        CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 0),                      /*!< Clock gate name: SENSE_ACCESS_RAM_ARBITER0*/
    kCLOCK_Hifi1        = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 1),    /*!< Clock gate name: HIFI1*/
    kCLOCK_Dma2         = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 4),    /*!< Clock gate name: DMA2*/
    kCLOCK_Dma3         = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 5),    /*!< Clock gate name: DMA3*/
    kCLOCK_LPFlexComm17 = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 6),    /*!< Clock gate name: LP_Flexcomm17*/
    kCLOCK_LPFlexComm18 = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 7),    /*!< Clock gate name: LP_Flexcomm18*/
    kCLOCK_LPFlexComm19 = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 8),    /*!< Clock gate name: LP_Flexcomm19*/
    kCLOCK_LPFlexComm20 = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 9),    /*!< Clock gate name: LP_Flexcomm20*/
    kCLOCK_LPI2c17      = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 6),    /*!< Clock gate name: LPI2C17*/
    kCLOCK_LPI2c18      = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 7),    /*!< Clock gate name: LPI2C18*/
    kCLOCK_LPI2c19      = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 8),    /*!< Clock gate name: LPI2C19*/
    kCLOCK_LPI2c20      = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 9),    /*!< Clock gate name: LPI2C20*/
    kCLOCK_LPSpi17      = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 6),    /*!< Clock gate name: LPSPI17*/
    kCLOCK_LPSpi18      = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 7),    /*!< Clock gate name: LPSPI18*/
    kCLOCK_LPSpi19      = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 8),    /*!< Clock gate name: LPSPI19*/
    kCLOCK_LPSpi20      = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 9),    /*!< Clock gate name: LPSPI20*/
    kCLOCK_LPUart17     = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 6),    /*!< Clock gate name: LPUART17*/
    kCLOCK_LPUart18     = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 7),    /*!< Clock gate name: LPUART18*/
    kCLOCK_LPUart19     = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 8),    /*!< Clock gate name: LPUART19*/
    kCLOCK_LPUart20     = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 9),    /*!< Clock gate name: LPUART20*/
    kCLOCK_Sai3         = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 10),   /*!< Clock gate name: SAI3*/
    kCLOCK_I3c2         = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 11),   /*!< Clock gate name: I3C2*/
    kCLOCK_I3c3         = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 12),   /*!< Clock gate name: I3C3*/
    kCLOCK_Gpio8        = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 13),   /*!< Clock gate name: GPIO8*/
    kCLOCK_Gpio9        = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 14),   /*!< Clock gate name: GPIO9*/
    kCLOCK_Gpio10       = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 15),   /*!< Clock gate name: GPIO10*/
    kCLOCK_Pint1        = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 16),   /*!< Clock gate name: PINT1*/
    kCLOCK_Ct32b5       = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 17),   /*!< Clock gate name: CTIMER5*/
    kCLOCK_Ct32b6       = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 18),   /*!< Clock gate name: CTIMER6*/
    kCLOCK_Ct32b7       = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 19),   /*!< Clock gate name: CTIMER7*/
    kCLOCK_Mrt1         = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 20),   /*!< Clock gate name: Mrt1*/
    kCLOCK_Utick1       = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 21),   /*!< Clock gate name: Utick1*/
    kCLOCK_Cdog3        = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 22),   /*!< Clock gate name: CDOG3*/
    kCLOCK_Cdog4        = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 23),   /*!< Clock gate name: CDOG4*/
    kCLOCK_Mu3          = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 24),   /*!< Clock gate name: MU3*/
    kCLOCK_Sema423      = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 25),   /*!< Clock gate name: SEMA42_3*/
    kCLOCK_Wwdt2        = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 26),   /*!< Clock gate name: WWDT2*/
    kCLOCK_Wwdt3        = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 27),   /*!< Clock gate name: WWDT3*/
    kCLOCK_Pvts1        = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 28),   /*!< Clock gate name: PINT1*/
    kCLOCK_InputMux1    = CLK_GATE_DEFINE(CLK_CTL1_PSCCTL1, 30),   /*!< Clock gate name: PMUX_SNS_SPLITTER*/

    kCLOCK_Syscon2 = CLK_GATE_DEFINE(CLK_CTL2_PSCCTL0, 3),         /*!< Clock gate name: SYSCON_COMM */
    kCLOCK_Iopctl2 = CLK_GATE_DEFINE(CLK_CTL2_PSCCTL0, 4),         /*!< Clock gate name: IOMUXC_VDDN */

