zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT798S/drivers/fsl_clock.h
/* CLKCTL0 CLKCTL_COM_VDD2*/
#if defined(FSL_CLOCK_DRIVER_COMPUTE) || defined(FSL_CLOCK_DRIVER_MEDIA)
#define CMPTMAINCLKDIV_OFFSET    0x400
#define CMPTBASECLKSEL_OFFSET    0x420
#define DSPBASECLKSEL_OFFSET     0x424
#define VDD2COMBASECLKSEL_OFFSET 0x428
#define MAINCLKSEL_OFFSET        0x434
#define DSPCPUCLKDIV_OFFSET      0x440
#define DSPCPUCLKSEL_OFFSET      0x444
#define RAMCLKSEL_OFFSET         0x450
#define RAMCLKDIV_OFFSET         0x45C
#define TPIUFCLKSEL_OFFSET       0x560
#define TPIUCLKDIV_OFFSET        0x564
#define XSPI0FCLKSEL_OFFSET      0x600
#define XSPI0FCLKDIV_OFFSET      0x604
#define XSPI1FCLKSEL_OFFSET      0x620
#define XSPI1FCLKDIV_OFFSET      0x624
#define SCTFCLKSEL_OFFSET        0x640
#define SCTFCLKDIV_OFFSET        0x644
#define UTICK0FCLKSEL_OFFSET     0x700
#define UTICK0CLKDIV_OFFSET      0x704
#define WWDT0FCLKSEL_OFFSET      0x720
#define WWDT1FCLKSEL_OFFSET      0x740
#define SYSTICKFCLKSEL_OFFSET    0x760
#define SYSTICKFCLKDIV_OFFSET    0x764
#define FCCLK0SEL_OFFSET         0x800
#define FC0FCLKSEL_OFFSET        0x808
#define FCCLK1SEL_OFFSET         0x820
#define FC1FCLKSEL_OFFSET        0x828
#define FCCLK2SEL_OFFSET         0x840
#define FC2FCLKSEL_OFFSET        0x848
#define FCCLK3SEL_OFFSET         0x860
#define FC3FCLKSEL_OFFSET        0x868
#define FC4FCLKSEL_OFFSET        0x888
#define FC5FCLKSEL_OFFSET        0x8A8
#define FC6FCLKSEL_OFFSET        0x8C8
#define FC7FCLKSEL_OFFSET        0x8E8
#define FC8FCLKSEL_OFFSET        0x908
#define FC9FCLKSEL_OFFSET        0x928
#define FC10FCLKSEL_OFFSET       0x948
#define FC11FCLKSEL_OFFSET       0x968
#define FC12FCLKSEL_OFFSET       0x988
#define FC13FCLKSEL_OFFSET       0x9A8
#define FCCLK0DIV_OFFSET         0x804
#define FCCLK1DIV_OFFSET         0x824
#define FCCLK2DIV_OFFSET         0x844
#define FCCLK3DIV_OFFSET         0x864
#define SAI012FCLKSEL_OFFSET     0x9C8
#define SAI012CLKDIV_OFFSET      0x9CC
#define CTIMER0CLKDIV_OFFSET     0xA00
#define CTIMER1CLKDIV_OFFSET     0xA04
#define CTIMER2CLKDIV_OFFSET     0xA08
#define CTIMER3CLKDIV_OFFSET     0xA0C
#define CTIMER4CLKDIV_OFFSET     0xA10
#define CTIMER0FCLKSEL_OFFSET    0xAA0
#define CTIMER1FCLKSEL_OFFSET    0xAA4
#define CTIMER2FCLKSEL_OFFSET    0xAA8
#define CTIMER3FCLKSEL_OFFSET    0xAAC
#define CTIMER4FCLKSEL_OFFSET    0xAB0
#define TRNGFCLKSEL_OFFSET       0xAC0
#define TRNGFCLKDIV_OFFSET       0xAC4
#define I3C01FCLKSEL_OFFSET      0xB00
#define I3C01PCLKSEL_OFFSET      0xB04
#define I3C01PCLKDIV_OFFSET      0xB08
#define I3C01FCLKDIV_OFFSET      0xB10
#define CLKOUTCLKSEL_OFFSET      0xB20
#define CLKOUTCLKDIV_OFFSET      0xB24
#define AUDIOVDD2CLKSEL_OFFSET   0xB30

#else

#define SENSEBASECLKSEL_OFFSET   0x438
#define SENSEDSPCPUCLKDIV_OFFSET 0x440
#define SENSEDSPCPUCLKSEL_OFFSET 0x444
#define SAI3FCLKSEL_OFFSET       0x500
#define SAI3CLKDIV_OFFSET        0x504
#define UTICK1FCLKSEL_OFFSET     0x700
#define UTICK1CLKDIV_OFFSET      0x704
#define WWDT2FCLKSEL_OFFSET      0x720
#define WWDT3FCLKSEL_OFFSET      0x740
#define SYSTICKFCLKSEL_OFFSET    0x760
#define SYSTICKFCLKDIV_OFFSET    0x764
#define CTIMER5FCLKSEL_OFFSET    0x7A0
#define CTIMER6FCLKSEL_OFFSET    0x7A4
#define CTIMER7FCLKSEL_OFFSET    0x7A8
#define CTIMER5CLKDIV_OFFSET     0x7B0
#define CTIMER6CLKDIV_OFFSET     0x7B4
#define CTIMER7CLKDIV_OFFSET     0x7B8
#define I3C23FCLKSEL_OFFSET      0x800
#define I3C23FCLKDIV_OFFSET      0x810
#define FC17FCLKSEL_OFFSET       0xA00
#define FC18FCLKSEL_OFFSET       0xA20
#define FC19FCLKSEL_OFFSET       0xA40
#define FC20FCLKSEL_OFFSET       0xA60
#define FC17FCLKDIV_OFFSET       0xA04
#define FC18FCLKDIV_OFFSET       0xA24
#define FC19FCLKDIV_OFFSET       0xA44
#define FC20FCLKDIV_OFFSET       0xA64
#define AUDIOVDD1CLKSEL_OFFSET   0xAA0
#endif

/* CLKCTL2 */
#define USBCLKSRC24MCLKSEL_OFFSET    0x10C
#define COMMONVDDNCLKSEL_OFFSET      0xA4
#define COMMONVDDNCLKDIV_OFFSET      0xAC
#define USBCLKSRC24MCLKSEL_OFFSET    0x10C
#define COMNBASECLKSEL_OFFSET        0x110
#define EUSBCLKSRC24MCLKSEL_OFFSET   0x11C
#define MAINPLL0CLKSEL_OFFSET        0x200
#define MAINPLL0LOCKTIMEDIV2_OFFSET  0x20C
#define AUDIOPLL0CLKSEL_OFFSET       0x400
#define AUDIOPLL0LOCKTIMEDIV2_OFFSET 0x40C

/* CLKCTL3 CLKCTL_VDD1_COM */
#define SENSEMAINCLKDIV_OFFSET    0x400
#define SENSE_MAINCLKSEL_OFFSET   0x434
#define SENSERAMCLKSEL_OFFSET     0x450
#define SENSERAMCLKDIV_OFFSET     0x45C
#define OSEVENTTFCLKSEL_OFFSET    0x480
#define OSEVENTFCLKDIV_OFFSET     0x484
#define SDADCFCLKSEL_OFFSET       0x600
#define SDADCFCLKDIV_OFFSET       0x604
#define SARADCFCLKSEL_OFFSET      0x620
#define SARADCFCLKDIV_OFFSET      0x624
#define WAKE32KCLKSEL_OFFSET      0x750
#define MICFIL0FCLKSEL_OFFSET     0x780
#define MICFIL0FCLKDIV_OFFSET     0x784
#define LPI2CFCLKSEL_OFFSET       0x788
#define LPI2CFCLKDIV_OFFSET       0x78C
#define SENSE_CLKOUTCLKSEL_OFFSET 0x800
#define SENSE_CLKOUTCLKDIV_OFFSET 0x804

/* CLKCTL4 CLKCTL_MED_VDD2 */
#define MEDIAVDDNCLKSEL_OFFSET  0xA4
#define MEDIAVDDNCLKDIV_OFFSET  0xAC
#define MEDIAMAINCLKSEL_OFFSET  0x104
#define MEDIAMAINCLKDIV_OFFSET  0x10C
#define MDNBASECLKSEL_OFFSET    0x110
#define MD2BASECLKSEL_OFFSET    0x114
#define XSPI2FCLKSEL_OFFSET     0x200
#define XSPI2FCLKDIV_OFFSET     0x204
#define USBFCLKSEL_OFFSET       0x220
#define EUSBFCLKSEL_OFFSET      0x240
#define SDIO0FCLKSEL_OFFSET     0x260
#define SDIO0FCLKDIV_OFFSET     0x264
#define SDIO1FCLKSEL_OFFSET     0x280
#define SDIO1FCLKDIV_OFFSET     0x284
#define DPHYCLKSEL_OFFSET       0x300
#define DPHYCLKDIV_OFFSET       0x304
#define DPHYESCCLKSEL_OFFSET    0x308
#define DPHYESCRXCLKDIV_OFFSET  0x30C
#define DPHYESCTXCLKDIV_OFFSET  0x310
#define VGPUCLKSEL_OFFSET       0x320
#define VGPUCLKDIV_OFFSET       0x324
#define LPSPI14CLKSEL_OFFSET    0x328
#define LPSPI14CLKDIV_OFFSET    0x32C
#define LPSPI16CLKSEL_OFFSET    0x330
#define LPSPI16CLKDIV_OFFSET    0x334
#define FLEXIOCLKSEL_OFFSET     0x338
#define FLEXIOCLKDIV_OFFSET     0x33C
#define LCDIFPIXELCLKSEL_OFFSET 0x340
#define LCDIFPIXELCLKDIV_OFFSET 0x344
#define LOWFREQCLKDIV_OFFSET    0x700

#define CLKCTL0_INDEX (0UL << CLK_MUX_INST_INDEX_SHIFT)
#define CLKCTL1_INDEX (1UL << CLK_MUX_INST_INDEX_SHIFT)
#define CLKCTL2_INDEX (2UL << CLK_MUX_INST_INDEX_SHIFT)
#define CLKCTL3_INDEX (3UL << CLK_MUX_INST_INDEX_SHIFT)
#define CLKCTL4_INDEX (4UL << CLK_MUX_INST_INDEX_SHIFT)

