zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT798S/drivers/fsl_clock.h
    kCOMPUTE_BASE_to_FCCLK0  = CLKCTL0_TUPLE_MUXA(FCCLK0SEL_OFFSET, 0), /*!< Attach compute base clock to FCCLK0. */
    kFRO0_DIV1_to_FCCLK0     = CLKCTL0_TUPLE_MUXA(FCCLK0SEL_OFFSET, 1), /*!< Attach FRO0 max clock to FCCLK0. */
    kMAIN_PLL_PFD3_to_FCCLK0 = CLKCTL0_TUPLE_MUXA(FCCLK0SEL_OFFSET, 2), /*!< Attach MAIN PLL PFD3 clock to FCCLK0. */
    kOSC_CLK_to_FCCLK0       = CLKCTL0_TUPLE_MUXA(FCCLK0SEL_OFFSET, 3), /*!< Attach OSC clock to FCCLK0. */
    kNONE_to_FCCLK0          = CLKCTL0_TUPLE_MUXA_NONE(FCCLK0SEL_OFFSET, 0), /*!< Attach NONE to FCCLK0. */

    kCOMPUTE_BASE_to_FCCLK1  = CLKCTL0_TUPLE_MUXA(FCCLK1SEL_OFFSET, 0), /*!< Attach compute base clock to FCCLK1. */
    kFRO0_DIV1_to_FCCLK1     = CLKCTL0_TUPLE_MUXA(FCCLK1SEL_OFFSET, 1), /*!< Attach FRO0 max clock to FCCLK1. */
    kMAIN_PLL_PFD3_to_FCCLK1 = CLKCTL0_TUPLE_MUXA(FCCLK1SEL_OFFSET, 2), /*!< Attach MAIN PLL PFD3 clock to FCCLK1. */
    kOSC_CLK_to_FCCLK1       = CLKCTL0_TUPLE_MUXA(FCCLK1SEL_OFFSET, 3), /*!< Attach OSC clock to FCCLK1. */
    kNONE_to_FCCLK1          = CLKCTL0_TUPLE_MUXA_NONE(FCCLK1SEL_OFFSET, 0), /*!< Attach NONE to FCCLK1. */

    kCOMPUTE_BASE_to_FCCLK2  = CLKCTL0_TUPLE_MUXA(FCCLK2SEL_OFFSET, 0), /*!< Attach compute base clock to FCCLK2. */
    kFRO0_DIV1_to_FCCLK2     = CLKCTL0_TUPLE_MUXA(FCCLK2SEL_OFFSET, 1), /*!< Attach FRO0 max clock to FCCLK2. */
    kMAIN_PLL_PFD3_to_FCCLK2 = CLKCTL0_TUPLE_MUXA(FCCLK2SEL_OFFSET, 2), /*!< Attach MAIN PLL PFD3 clock to FCCLK2. */
    kOSC_CLK_to_FCCLK2       = CLKCTL0_TUPLE_MUXA(FCCLK2SEL_OFFSET, 3), /*!< Attach OSC clock to FCCLK2. */
    kNONE_to_FCCLK2          = CLKCTL0_TUPLE_MUXA_NONE(FCCLK2SEL_OFFSET, 0), /*!< Attach NONE to FCCLK2. */

    kCOMPUTE_BASE_to_FCCLK3  = CLKCTL0_TUPLE_MUXA(FCCLK3SEL_OFFSET, 0), /*!< Attach compute base clock to FCCLK3. */
    kFRO0_DIV1_to_FCCLK3     = CLKCTL0_TUPLE_MUXA(FCCLK3SEL_OFFSET, 1), /*!< Attach FRO0 max clock to FCCLK3. */
    kMAIN_PLL_PFD3_to_FCCLK3 = CLKCTL0_TUPLE_MUXA(FCCLK3SEL_OFFSET, 2), /*!< Attach MAIN PLL PFD3 clock to FCCLK3. */
    kOSC_CLK_to_FCCLK3       = CLKCTL0_TUPLE_MUXA(FCCLK3SEL_OFFSET, 3), /*!< Attach OSC clock to FCCLK3. */
    kNONE_to_FCCLK3          = CLKCTL0_TUPLE_MUXA_NONE(FCCLK3SEL_OFFSET, 0), /*!< Attach NONE to FCCLK3. */

    kFCCLK0_to_FLEXCOMM0 = CLKCTL0_TUPLE_MUXA(FC0FCLKSEL_OFFSET, 0),         /*!< Attach FCCLK0 to FLEXCOMM0. */
    kFCCLK1_to_FLEXCOMM0 = CLKCTL0_TUPLE_MUXA(FC0FCLKSEL_OFFSET, 1),         /*!< Attach FCCLK1 to FLEXCOMM0. */
    kFCCLK2_to_FLEXCOMM0 = CLKCTL0_TUPLE_MUXA(FC0FCLKSEL_OFFSET, 2),         /*!< Attach FCCLK2 to FLEXCOMM0. */
    kFCCLK3_to_FLEXCOMM0 = CLKCTL0_TUPLE_MUXA(FC0FCLKSEL_OFFSET, 3),         /*!< Attach FCCLK3 to FLEXCOMM0. */
    kNONE_to_FLEXCOMM0   = CLKCTL0_TUPLE_MUXA_NONE(FC0FCLKSEL_OFFSET, 0),    /*!< Attach NONE to FLEXCOMM0. */

    kFCCLK0_to_FLEXCOMM1 = CLKCTL0_TUPLE_MUXA(FC1FCLKSEL_OFFSET, 0),         /*!< Attach FCCLK0 to FLEXCOMM1. */
    kFCCLK1_to_FLEXCOMM1 = CLKCTL0_TUPLE_MUXA(FC1FCLKSEL_OFFSET, 1),         /*!< Attach FCCLK1 to FLEXCOMM1. */
    kFCCLK2_to_FLEXCOMM1 = CLKCTL0_TUPLE_MUXA(FC1FCLKSEL_OFFSET, 2),         /*!< Attach FCCLK2 to FLEXCOMM1. */
    kFCCLK3_to_FLEXCOMM1 = CLKCTL0_TUPLE_MUXA(FC1FCLKSEL_OFFSET, 3),         /*!< Attach FCCLK3 to FLEXCOMM1. */
    kNONE_to_FLEXCOMM1   = CLKCTL0_TUPLE_MUXA_NONE(FC1FCLKSEL_OFFSET, 0),    /*!< Attach NONE to FLEXCOMM1. */

    kFCCLK0_to_FLEXCOMM2 = CLKCTL0_TUPLE_MUXA(FC2FCLKSEL_OFFSET, 0),         /*!< Attach FCCLK0 to FLEXCOMM2. */
    kFCCLK1_to_FLEXCOMM2 = CLKCTL0_TUPLE_MUXA(FC2FCLKSEL_OFFSET, 1),         /*!< Attach FCCLK1 to FLEXCOMM2. */
    kFCCLK2_to_FLEXCOMM2 = CLKCTL0_TUPLE_MUXA(FC2FCLKSEL_OFFSET, 2),         /*!< Attach FCCLK2 to FLEXCOMM2. */
    kFCCLK3_to_FLEXCOMM2 = CLKCTL0_TUPLE_MUXA(FC2FCLKSEL_OFFSET, 3),         /*!< Attach FCCLK3 to FLEXCOMM2. */
    kNONE_to_FLEXCOMM2   = CLKCTL0_TUPLE_MUXA_NONE(FC2FCLKSEL_OFFSET, 0),    /*!< Attach NONE to FLEXCOMM2. */

    kFCCLK0_to_FLEXCOMM3 = CLKCTL0_TUPLE_MUXA(FC3FCLKSEL_OFFSET, 0),         /*!< Attach FCCLK0 to FLEXCOMM3. */
    kFCCLK1_to_FLEXCOMM3 = CLKCTL0_TUPLE_MUXA(FC3FCLKSEL_OFFSET, 1),         /*!< Attach FCCLK1 to FLEXCOMM3. */
    kFCCLK2_to_FLEXCOMM3 = CLKCTL0_TUPLE_MUXA(FC3FCLKSEL_OFFSET, 2),         /*!< Attach FCCLK2 to FLEXCOMM3. */
    kFCCLK3_to_FLEXCOMM3 = CLKCTL0_TUPLE_MUXA(FC3FCLKSEL_OFFSET, 3),         /*!< Attach FCCLK3 to FLEXCOMM3. */
    kNONE_to_FLEXCOMM3   = CLKCTL0_TUPLE_MUXA_NONE(FC3FCLKSEL_OFFSET, 0),    /*!< Attach NONE to FLEXCOMM3. */

    kFCCLK0_to_FLEXCOMM4 = CLKCTL0_TUPLE_MUXA(FC4FCLKSEL_OFFSET, 0),         /*!< Attach FCCLK0 to FLEXCOMM4. */
    kFCCLK1_to_FLEXCOMM4 = CLKCTL0_TUPLE_MUXA(FC4FCLKSEL_OFFSET, 1),         /*!< Attach FCCLK1 to FLEXCOMM4. */
    kFCCLK2_to_FLEXCOMM4 = CLKCTL0_TUPLE_MUXA(FC4FCLKSEL_OFFSET, 2),         /*!< Attach FCCLK2 to FLEXCOMM4. */
    kFCCLK3_to_FLEXCOMM4 = CLKCTL0_TUPLE_MUXA(FC4FCLKSEL_OFFSET, 3),         /*!< Attach FCCLK3 to FLEXCOMM4. */
    kNONE_to_FLEXCOMM4   = CLKCTL0_TUPLE_MUXA_NONE(FC4FCLKSEL_OFFSET, 0),    /*!< Attach NONE to FLEXCOMM4. */

    kFCCLK0_to_FLEXCOMM5 = CLKCTL0_TUPLE_MUXA(FC5FCLKSEL_OFFSET, 0),         /*!< Attach FCCLK0 to FLEXCOMM5. */
    kFCCLK1_to_FLEXCOMM5 = CLKCTL0_TUPLE_MUXA(FC5FCLKSEL_OFFSET, 1),         /*!< Attach FCCLK1 to FLEXCOMM5. */
    kFCCLK2_to_FLEXCOMM5 = CLKCTL0_TUPLE_MUXA(FC5FCLKSEL_OFFSET, 2),         /*!< Attach FCCLK2 to FLEXCOMM5. */
    kFCCLK3_to_FLEXCOMM5 = CLKCTL0_TUPLE_MUXA(FC5FCLKSEL_OFFSET, 3),         /*!< Attach FCCLK3 to FLEXCOMM5. */
    kNONE_to_FLEXCOMM5   = CLKCTL0_TUPLE_MUXA_NONE(FC5FCLKSEL_OFFSET, 0),    /*!< Attach NONE to FLEXCOMM5. */

    kFCCLK0_to_FLEXCOMM6 = CLKCTL0_TUPLE_MUXA(FC6FCLKSEL_OFFSET, 0),         /*!< Attach FCCLK0 to FLEXCOMM6. */
    kFCCLK1_to_FLEXCOMM6 = CLKCTL0_TUPLE_MUXA(FC6FCLKSEL_OFFSET, 1),         /*!< Attach FCCLK1 to FLEXCOMM6. */
    kFCCLK2_to_FLEXCOMM6 = CLKCTL0_TUPLE_MUXA(FC6FCLKSEL_OFFSET, 2),         /*!< Attach FCCLK2 to FLEXCOMM6. */
    kFCCLK3_to_FLEXCOMM6 = CLKCTL0_TUPLE_MUXA(FC6FCLKSEL_OFFSET, 3),         /*!< Attach FCCLK3 to FLEXCOMM6. */
    kNONE_to_FLEXCOMM6   = CLKCTL0_TUPLE_MUXA_NONE(FC6FCLKSEL_OFFSET, 0),    /*!< Attach NONE to FLEXCOMM6. */

    kFCCLK0_to_FLEXCOMM7 = CLKCTL0_TUPLE_MUXA(FC7FCLKSEL_OFFSET, 0),         /*!< Attach FCCLK0 to FLEXCOMM7. */
    kFCCLK1_to_FLEXCOMM7 = CLKCTL0_TUPLE_MUXA(FC7FCLKSEL_OFFSET, 1),         /*!< Attach FCCLK1 to FLEXCOMM7. */
    kFCCLK2_to_FLEXCOMM7 = CLKCTL0_TUPLE_MUXA(FC7FCLKSEL_OFFSET, 2),         /*!< Attach FCCLK2 to FLEXCOMM7. */
    kFCCLK3_to_FLEXCOMM7 = CLKCTL0_TUPLE_MUXA(FC7FCLKSEL_OFFSET, 3),         /*!< Attach FCCLK3 to FLEXCOMM7. */
    kNONE_to_FLEXCOMM7   = CLKCTL0_TUPLE_MUXA_NONE(FC7FCLKSEL_OFFSET, 0),    /*!< Attach NONE to FLEXCOMM7. */

    kFCCLK0_to_FLEXCOMM8 = CLKCTL0_TUPLE_MUXA(FC8FCLKSEL_OFFSET, 0),         /*!< Attach FCCLK0 to FLEXCOMM8. */
    kFCCLK1_to_FLEXCOMM8 = CLKCTL0_TUPLE_MUXA(FC8FCLKSEL_OFFSET, 1),         /*!< Attach FCCLK1 to FLEXCOMM8. */
    kFCCLK2_to_FLEXCOMM8 = CLKCTL0_TUPLE_MUXA(FC8FCLKSEL_OFFSET, 2),         /*!< Attach FCCLK2 to FLEXCOMM8. */
    kFCCLK3_to_FLEXCOMM8 = CLKCTL0_TUPLE_MUXA(FC8FCLKSEL_OFFSET, 3),         /*!< Attach FCCLK3 to FLEXCOMM8. */
    kNONE_to_FLEXCOMM8   = CLKCTL0_TUPLE_MUXA_NONE(FC8FCLKSEL_OFFSET, 0),    /*!< Attach NONE to FLEXCOMM8. */

    kFCCLK0_to_FLEXCOMM9 = CLKCTL0_TUPLE_MUXA(FC9FCLKSEL_OFFSET, 0),         /*!< Attach FCCLK0 to FLEXCOMM9. */
    kFCCLK1_to_FLEXCOMM9 = CLKCTL0_TUPLE_MUXA(FC9FCLKSEL_OFFSET, 1),         /*!< Attach FCCLK1 to FLEXCOMM9. */
    kFCCLK2_to_FLEXCOMM9 = CLKCTL0_TUPLE_MUXA(FC9FCLKSEL_OFFSET, 2),         /*!< Attach FCCLK2 to FLEXCOMM9. */
    kFCCLK3_to_FLEXCOMM9 = CLKCTL0_TUPLE_MUXA(FC9FCLKSEL_OFFSET, 3),         /*!< Attach FCCLK3 to FLEXCOMM9. */
    kNONE_to_FLEXCOMM9   = CLKCTL0_TUPLE_MUXA_NONE(FC9FCLKSEL_OFFSET, 0),    /*!< Attach NONE to FLEXCOMM9. */

    kFCCLK0_to_FLEXCOMM10 = CLKCTL0_TUPLE_MUXA(FC10FCLKSEL_OFFSET, 0),       /*!< Attach FCCLK0 to FLEXCOMM10. */
    kFCCLK1_to_FLEXCOMM10 = CLKCTL0_TUPLE_MUXA(FC10FCLKSEL_OFFSET, 1),       /*!< Attach FCCLK1 to FLEXCOMM10. */
    kFCCLK2_to_FLEXCOMM10 = CLKCTL0_TUPLE_MUXA(FC10FCLKSEL_OFFSET, 2),       /*!< Attach FCCLK2 to FLEXCOMM10. */
    kFCCLK3_to_FLEXCOMM10 = CLKCTL0_TUPLE_MUXA(FC10FCLKSEL_OFFSET, 3),       /*!< Attach FCCLK3 to FLEXCOMM10. */
    kNONE_to_FLEXCOMM10   = CLKCTL0_TUPLE_MUXA_NONE(FC10FCLKSEL_OFFSET, 0),  /*!< Attach NONE to FLEXCOMM10. */

    kFCCLK0_to_FLEXCOMM11 = CLKCTL0_TUPLE_MUXA(FC11FCLKSEL_OFFSET, 0),       /*!< Attach FCCLK0 to FLEXCOMM11. */
    kFCCLK1_to_FLEXCOMM11 = CLKCTL0_TUPLE_MUXA(FC11FCLKSEL_OFFSET, 1),       /*!< Attach FCCLK1 to FLEXCOMM11. */
    kFCCLK2_to_FLEXCOMM11 = CLKCTL0_TUPLE_MUXA(FC11FCLKSEL_OFFSET, 2),       /*!< Attach FCCLK2 to FLEXCOMM11. */
    kFCCLK3_to_FLEXCOMM11 = CLKCTL0_TUPLE_MUXA(FC11FCLKSEL_OFFSET, 3),       /*!< Attach FCCLK3 to FLEXCOMM11. */
    kNONE_to_FLEXCOMM11   = CLKCTL0_TUPLE_MUXA_NONE(FC11FCLKSEL_OFFSET, 0),  /*!< Attach NONE to FLEXCOMM11. */

    kFCCLK0_to_FLEXCOMM12 = CLKCTL0_TUPLE_MUXA(FC12FCLKSEL_OFFSET, 0),       /*!< Attach FCCLK0 to FLEXCOMM12. */
    kFCCLK1_to_FLEXCOMM12 = CLKCTL0_TUPLE_MUXA(FC12FCLKSEL_OFFSET, 1),       /*!< Attach FCCLK1 to FLEXCOMM12. */
    kFCCLK2_to_FLEXCOMM12 = CLKCTL0_TUPLE_MUXA(FC12FCLKSEL_OFFSET, 2),       /*!< Attach FCCLK2 to FLEXCOMM12. */
    kFCCLK3_to_FLEXCOMM12 = CLKCTL0_TUPLE_MUXA(FC12FCLKSEL_OFFSET, 3),       /*!< Attach FCCLK3 to FLEXCOMM12. */
    kNONE_to_FLEXCOMM12   = CLKCTL0_TUPLE_MUXA_NONE(FC12FCLKSEL_OFFSET, 0),  /*!< Attach NONE to FLEXCOMM12. */

    kFCCLK0_to_FLEXCOMM13 = CLKCTL0_TUPLE_MUXA(FC13FCLKSEL_OFFSET, 0),       /*!< Attach FCCLK0 to FLEXCOMM13. */
    kFCCLK1_to_FLEXCOMM13 = CLKCTL0_TUPLE_MUXA(FC13FCLKSEL_OFFSET, 1),       /*!< Attach FCCLK1 to FLEXCOMM13. */
    kFCCLK2_to_FLEXCOMM13 = CLKCTL0_TUPLE_MUXA(FC13FCLKSEL_OFFSET, 2),       /*!< Attach FCCLK2 to FLEXCOMM13. */
    kFCCLK3_to_FLEXCOMM13 = CLKCTL0_TUPLE_MUXA(FC13FCLKSEL_OFFSET, 3),       /*!< Attach FCCLK3 to FLEXCOMM13. */
    kNONE_to_FLEXCOMM13   = CLKCTL0_TUPLE_MUXA_NONE(FC13FCLKSEL_OFFSET, 0),  /*!< Attach NONE to FLEXCOMM13. */

    kCOMPUTE_BASE_to_CTIMER0 =
        CLKCTL0_TUPLE_MUXA(CTIMER0FCLKSEL_OFFSET, 0), /*!< Attach Compute base clock to CTIMER0 Clock. */
    kAUDIO_VDD2_to_CTIMER0 =
        CLKCTL0_TUPLE_MUXA(CTIMER0FCLKSEL_OFFSET, 1), /*!< Attach audio_clk_cmpt clock to CTIMER0 Clock. */
    kFRO0_DIV1_to_CTIMER0 =
        CLKCTL0_TUPLE_MUXA(CTIMER0FCLKSEL_OFFSET, 2), /*!< Attach FRO0 max clock to CTIMER0 Clock. */
    k32KHZ_WAKE_to_CTIMER0 =
        CLKCTL0_TUPLE_MUXA(CTIMER0FCLKSEL_OFFSET, 3), /*!< Attach 32KHz wake clock to CTIMER0 Clock. */
    kNONE_to_CTIMER0 = CLKCTL0_TUPLE_MUXA_NONE(CTIMER0FCLKSEL_OFFSET, 0), /*!< Attach NONE to CTIMER0 Clock. */

