zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT798S/drivers/fsl_clock.h
/*! @brief FRO output enable. */
typedef enum _clock_fro_output_en
{
    kCLOCK_FroDiv1OutEn = FRO_CSR_CLKGATE(0x1U),  /*!< Enable Fro Div1 output. */
    kCLOCK_FroDiv2OutEn = FRO_CSR_CLKGATE(0x2U),  /*!< Enable Fro Div2 output. */
    kCLOCK_FroDiv3OutEn = FRO_CSR_CLKGATE(0x4U),  /*!< Enable Fro Div3 output. */
    kCLOCK_FroDiv6OutEn = FRO_CSR_CLKGATE(0x8U),  /*!< Enable Fro Div6 output. */
    kCLOCK_FroDiv8OutEn = FRO_CSR_CLKGATE(0x10U), /*!< Enable Fro Div8 output. */
    kCLOCK_FroAllOutEn  = FRO_CSR_CLKGATE_MASK,   /*!< Enable all Fro output. */
} clock_fro_output_en_t;

/*! @brief FRO Interrupt control. */
enum _clock_fro_interrupt
{
    kCLOCK_FroTrimUpdateReqInt = FRO_CNFG1_TRUPREQ_IE_MASK,  /*!< Trim Update Request Interrupt Enable. */
    kCLOCK_FroTuneErrInt       = FRO_CNFG1_TUNE_ERR_IE_MASK, /*!< Tune Error Interrupt Enable. */
    kCLOCK_FroLossOfLockInt    = FRO_CNFG1_LOL_ERR_IE_MASK,  /*!< Loss-of-Lock Error Interrupt Enable. */
    kCLOCK_FroAllIntterrupt =
        kCLOCK_FroTrimUpdateReqInt | kCLOCK_FroTuneErrInt | kCLOCK_FroLossOfLockInt, /*!< All Interrupt Enable. */
};

/*! @brief FRO flags. */
enum _clock_fro_flag
{
    kCLOCK_FroTuneOnceDone  = FRO_CSR_TUNEONCE_DONE_MASK, /*!< FRO Tune Once Done Flag. */
    kCLOCK_FroTrimLock      = FRO_CSR_TRIM_LOCK_MASK,     /*!< FRO Trim Lock Flag. */
    kCLOCK_FroTrimUpdateReq = FRO_CSR_TRUPREQ_MASK,       /*!< FRO Trim Update Request Flag. */
    kCLOCK_FroTuneErr       = FRO_CSR_TUNE_ERR_MASK,      /*!< FRO Tune Error Flag. */
    kCLOCK_FroLossOfLockErr = FRO_CSR_LOL_ERR_MASK,       /*!< FRO Loss-of-lock Error Flag. */
};

/*! @brief FRO configuration. */
typedef struct _clock_fro_config
{
    uint32_t targetFreq;   /*!< Target frequency. */
    uint16_t refDiv;       /*!< OSC Reference clock divider. 1 for divide ratio 1.*/
    uint16_t trim1DelayUs; /*!< Trim 1 delay in us, minimum is 15us. Used when running in Closed Loop mode and trim
                              values are updated by 1 decimal unit.*/
    uint16_t trim2DelayUs; /*!< Trim 2 delay in us. Used at start of closed loop mode when auto tuner is updating trim
                              values by 16 decimal unit steps */
    uint8_t range; /*!< Trim Expected Count Range. Specifies the + or - counts that the FRO frequency can be off from
                      TEXPCNT to be considerred locked. The value/100 is the % deviation. */
    uint32_t enableInt; /*!< Enable interrupts. Bit mask of #_clock_fro_interrupt. */
    bool coarseTrimEn;  /*!< Coarse Trim Enable. Set to true to allow autotrimming of the FRO high-byte trim bits. */
    bool fastStartupEn; /*!< Fast startup Enable. Enables FRO fast startup. */
} clock_fro_config_t;

/*! @brief Clock Control for each power domain. */
typedef enum _clock_domain_enable
{
    kCLOCK_Vdd2CompDomainEnable  = 0x1U,  /*!<  Clock Control of VDD2_COMP Domain. */
    kCLOCK_Vdd1SenseDomainEnable = 0x2U,  /*!< Clock Control of VDD1_SENSE Domain. */
    kCLOCK_Vdd2DspDomainEnable   = 0x4U,  /*!< Clock Control of VDD2_DSP Domain. */
    kCLOCK_Vdd2MediaDomainEnable = 0x8U,  /*!< Clock Control of VDD2_MEDIA Domain. */
    kCLOCK_VddnMediaDomainEnable = 0x10U, /*!< Clock Control of VDDN_MEDIA Domain. */
    kCLOCK_Vdd2ComDomainEnable   = 0x20U, /*!< Clock Control of VDD2_COM Domain. */
    kCLOCK_VddnComDomainEnable   = 0x40U, /*!< Clock Control of VDDN_COM Domain. */
    kCLOCK_AllDomainEnable       = 0x7FU  /*!< Clock Control of all Domain. */
} clock_domain_enable_t;

/*!
 * @brief PLL PFD clock name
 */
typedef enum _clock_pfd
{
    kCLOCK_Pfd0 = 0U, /*!< PLL PFD0 */
    kCLOCK_Pfd1 = 1U, /*!< PLL PFD1 */
    kCLOCK_Pfd2 = 2U, /*!< PLL PFD2 */
    kCLOCK_Pfd3 = 3U, /*!< PLL PFD3 */
} clock_pfd_t;

/*! @brief MainPLL Reference Input Clock Source */
typedef enum _main_pll_src
{
    kCLOCK_MainPllFro1Div8 = 0, /*!< FRO1_DIV8 clock */
    kCLOCK_MainPllOscClk   = 1, /*!< OSC clock */
} main_pll_src_t;

/*! @brief MainPLL Multiplication Factor */
typedef enum _main_pll_mult
{
    kCLOCK_MainPllMult16 = 16U, /*!< Divide by 16 */
    kCLOCK_MainPllMult17 = 17U, /*!< Divide by 17 */
    kCLOCK_MainPllMult18 = 18U, /*!< Divide by 18 */
    kCLOCK_MainPllMult19 = 19U, /*!< Divide by 19 */
    kCLOCK_MainPllMult20 = 20U, /*!< Divide by 20 */
    kCLOCK_MainPllMult21 = 21U, /*!< Divide by 21 */
    kCLOCK_MainPllMult22 = 22U, /*!< Divide by 22 */
} main_pll_mult_t;

/*! @brief PLL configuration for MAINPLL */
typedef struct _clock_main_pll_config
{
    main_pll_src_t main_pll_src;   /*!< Reference Input Clock Source. */
    uint32_t numerator;            /*!< 30 bit numerator of fractional loop divider. */
    uint32_t denominator;          /*!< 30 bit numerator of fractional loop divider. */
    main_pll_mult_t main_pll_mult; /*!< Multiplication Factor. */
} clock_main_pll_config_t;

/*! @brief AudioPll Reference Input Clock Source */
typedef enum _audio_pll_src
{
    kCLOCK_AudioPllFro1Div8 = 0, /*!< FRO1_DIV8 clock */
    kCLOCK_AudioPllOscClk   = 1, /*!< OSC clock */
} audio_pll_src_t;

/*! @brief AudioPll Multiplication Factor */
typedef enum _audio_pll_mult
{
    kCLOCK_AudioPllMult16 = 16U, /*!< Divide by 16 */
    kCLOCK_AudioPllMult17 = 17U, /*!< Divide by 17 */
    kCLOCK_AudioPllMult18 = 18U, /*!< Divide by 18 */
    kCLOCK_AudioPllMult19 = 19U, /*!< Divide by 19 */
    kCLOCK_AudioPllMult20 = 20U, /*!< Divide by 20 */
    kCLOCK_AudioPllMult21 = 21U, /*!< Divide by 21 */
    kCLOCK_AudioPllMult22 = 22U, /*!< Divide by 22 */
} audio_pll_mult_t;

/*! @brief PLL configuration for Audio PLL */
typedef struct _clock_audio_pll_config
{
    audio_pll_src_t audio_pll_src;   /*!< Reference Input Clock Source. */
    uint32_t numerator;              /*!< 30 bit numerator of fractional loop divider. */
    uint32_t denominator;            /*!< 30 bit numerator of fractional loop divider. */
    audio_pll_mult_t audio_pll_mult; /*!< Multiplication Factor. */
    bool enableVcoOut;               /*!< Enable VCO output */
} clock_audio_pll_config_t;

/*! @brief Capacitor Trim Value for OSC32KNP */
typedef enum _osc32k_cap_trim
{
    kCLOCK_Osc32kCapPf0 = 0U, /*!< Capacitor Trim Value 0pF. */
    kCLOCK_Osc32kCapPf2,      /*!< Capacitor Trim Value 2pF. */
    kCLOCK_Osc32kCapPf4,      /*!< Capacitor Trim Value 4pF. */
    kCLOCK_Osc32kCapPf6,      /*!< Capacitor Trim Value 6pF. */
    kCLOCK_Osc32kCapPf8,      /*!< Capacitor Trim Value 8pF. */
    kCLOCK_Osc32kCapPf10,     /*!< Capacitor Trim Value 10pF. */
    kCLOCK_Osc32kCapPf12,     /*!< Capacitor Trim Value 12pF. */
    kCLOCK_Osc32kCapPf14,     /*!< Capacitor Trim Value 14pF. */
    kCLOCK_Osc32kCapPf16,     /*!< Capacitor Trim Value 16pF. */
    kCLOCK_Osc32kCapPf18,     /*!< Capacitor Trim Value 18pF. */
    kCLOCK_Osc32kCapPf20,     /*!< Capacitor Trim Value 20pF. */
    kCLOCK_Osc32kCapPf22,     /*!< Capacitor Trim Value 22pF. */
    kCLOCK_Osc32kCapPf24,     /*!< Capacitor Trim Value 24pF. */
    kCLOCK_Osc32kCapPf26,     /*!< Capacitor Trim Value 26pF. */
    kCLOCK_Osc32kCapPf28,     /*!< Capacitor Trim Value 28pF. */
    kCLOCK_Osc32kCapPf30,     /*!< Capacitor Trim Value 30pF. */
} osc32k_cap_trim_t;

/*! @brief configuration for 32K OSC */
typedef struct _clock_osc32k_config_t
{
    bool bypass;        /*!< Bypass enable. */
    bool monitorEnable; /*!< Clock Monitor Enable. */
    bool lowPowerMode; /*!< Low-Power (Nano-Power) mode enable. NOTE, can only change from High-Power mode to Nano-Power
                          mode, and not vice versa. */
    osc32k_cap_trim_t cap; /*!< Capacitor Trim Value. */
} clock_osc32k_config_t;

