zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT798S/drivers/fsl_clock.h
/*! @brief  FRO Tune once. Use FRO tuneonce feature to calculate the FRO output frequency with given trimVal.
 *  The FRO should be powered up and reference clock(SOSC) should be enabled.
 *  @param  base : base address of FRO.
 *  @param  trimVal : trim value.
 *  @return FRO frequency in Hz.
 */
uint32_t CLOCK_FroTuneOnce(FRO_Type *base, uint16_t trimVal);

/*! @brief  Fine tune FRO output frequency in open loop mode. 
 *  The FRO should be powered up and reference clock(SOSC) should be enabled. The API uses the FRO tuneonce feature to
 *  try trim values from (trimVal-1, trimVal, trimVal+1) and select a best one.
 *  @param  base : base address of FRO.
 *  @param  targetFreq : Target frequency in Hz.
 *  @param  trimVal : trim value. When CLOCK_EnableFroClkFreqCloseLoop failed to lock, the value in FRO AUTOTRIM register
 *  can be used to do fine tune. 
 */
void CLOCK_FroFineTune(FRO_Type *base, uint32_t targetFreq, uint16_t trimVal);

/*! @brief  Get FRO flags.
 *  @param  base : base address of FRO.
 *  @param  flags Or'ed value of #_clock_fro_flag.
 */
uint32_t CLOCK_GetFroFlags(FRO_Type *base);

/*! @brief  Clear FRO flags.
 *  @param  base : base address of FRO.
 *  @param  flags Or'ed value of #_clock_fro_flag to clear.
 */
inline static void CLOCK_ClearFroFlags(FRO_Type *base, uint32_t flags)
{
    base->CSR.CLR = flags;
}

/*! @brief  Enable/Disable FRO fast startup.
 *  @param  base : base address of FRO.
 *  @param  enable, true to enable fast startup, false to disable fast startup.
 */
inline static void CLOCK_EnableFroFastStartup(FRO_Type *base, bool enable)
{
    if (enable)
    {
        base->CNFG1.SET = FRO_CNFG1_FSTUPEN_MASK;
    }
    else
    {
        base->CNFG1.CLR = FRO_CNFG1_FSTUPEN_MASK;
    }
}

/*! @brief  Return Frequency of FRO clk
 *  @param id FRO index
 *  @return Frequency of FRO clk
 */
uint32_t CLOCK_GetFroClkFreq(uint32_t id);

/*! @brief  Return Frequency of sense main clk
 *  @return Frequency of main clk
 */
uint32_t CLOCK_GetSenseMainClkFreq(void);

/*! @brief  Return Frequency of MAINPLL
 *  @return Frequency of MAINPLL
 */
uint32_t CLOCK_GetMainPllFreq(void);

/*! @brief  Get current output frequency of specific Main PLL PFD.
 *  @param   pfd    : pfd name to get frequency.
 *  @return  Frequency of MainPLL PFD.
 */
uint32_t CLOCK_GetMainPfdFreq(clock_pfd_t pfd);

/*! @brief  Return Frequency of AUDIO PLL
 *  @return Frequency of AUDIO PLL
 */
uint32_t CLOCK_GetAudioPllFreq(void);

/*! @brief  Get current output frequency of specific Audio PLL PFD.
 *  @param   pfd    : pfd name to get frequency.
 *  @return  Frequency of AUDIO PLL PFD.
 */

uint32_t CLOCK_GetAudioPfdFreq(clock_pfd_t pfd);
/*! @brief  Return Frequency of High-Freq output of FRO
 *  @return Frequency of High-Freq output of FRO
 */

/*! @brief  Return Frequency of sys osc Clock
 *  @return Frequency of sys osc Clock. Or CLK_IN pin frequency.
 */
static inline uint32_t CLOCK_GetXtalInClkFreq(void)
{
    return ((g_xtalFreq != 0U) ? g_xtalFreq : g_clkinFreq);
}

/*! @brief  Return Frequency of Sense Base clock
 *  @return Frequency of sense base clk
 */
uint32_t CLOCK_GetSenseBaseClkFreq(void);

/*! @brief  Enable/Disable sys osc clock from external crystal clock.
 *  @param  enable : true to enable system osc clock, false to bypass system
 * osc.
 *  @param  enableLowPower : true to enable low power mode, false to enable high
 * gain mode.
 *  @param  delay_us : Delay time after OSC power up.
 */
void CLOCK_EnableSysOscClk(bool enable, bool enableLowPower, uint32_t delay_us);

/*! @brief  Return Frequency of VDDN_COM Base Clock
 *  @return Frequency of baseclk_comn
 */
uint32_t CLOCK_GetVddnComBaseClkFreq(void);

/*! @brief  Return Frequency of VDDN_MEDIA Base Clock
 *  @return Frequency of baseclk_mdn
 */
uint32_t CLOCK_GetVddnMediaBaseClkFreq(void);

/*! @brief  Return Frequency of VDD2_MEDIA Base Clock
 *  @return Frequency of baseclk_md2
 */
uint32_t CLOCK_GetVdd2MediaBaseClkFreq(void);

/*! @brief  Return Frequency of MEDIA_MAIN Clock
 *  @return Frequency of media_main_clk
 */
uint32_t CLOCK_GetMediaMainClkFreq(void);

/*! @brief  Return Frequency of MEDIA_VDDN Clock
 *  @return Frequency of media_vddn_clk
 */
uint32_t CLOCK_GetMediaVddnClkFreq(void);

/*! @brief  Enable/Disable FRO2 clock for various domains.
 *  @param  domainEnable : Or'ed value of #clock_domain_enable_t to enable
 * DRFO2 max clock for certain domain.
 */
void CLOCK_EnableFro2ClkForDomain(uint32_t domainEnable);

/*! @brief  Enable/Disable MainPLL PFD clock for various domains.
 *
 * Enables PFD clock of MainPLL for various domains. Each PFD clock of MainPLL can be sent to various domain. To reduce
 * power consumption, turn off the PFD in the domain when this PFD is not configured.
 *  @param pfd  : Which PFD clock to control.
 *  @param  domainEnable : Or'ed value of #clock_domain_enable_t to enable
 * clock for certain domain.
 */
void CLOCK_EnableMainPllPfdClkForDomain(clock_pfd_t pfd, uint32_t domainEnable);

/*! @brief  Enable/Disable AUDIO PFD clock for various domains.
 *
 * Enables PFD clock of AUDIO for various domains. Each PFD clock of AUDIO can be sent to various domain. To reduce
 * power consumption, turn off the PFD in the domain when this PFD is not configured.
 *  @param pfd  : Which PFD clock to control.
 *  @param  domainEnable : Or'ed value of #clock_domain_enable_t to enable
 * clock for certain domain.
 */
void CLOCK_EnableAudioPllPfdClkForDomain(clock_pfd_t pfd, uint32_t domainEnable);

/*! @brief  Enable/Disable AUDIO VCO clock for various domains.
 *
 * VCO clock of Audio PLL can be sent to various domains to reduce power consumption when VCO is not set to use in such
 * domain. This VCO can be disabled for such domain.
 *  @param  domainEnable : Or'ed value of #clock_domain_enable_t to enable
 * clock for certain domain.
 */
void CLOCK_EnableAudioPllVcoClkForDomain(uint32_t domainEnable);

/*! @brief  Initialize the Main PLL.
 *  @param  config    : Configuration to set to PLL.
 */
void CLOCK_InitMainPll(const clock_main_pll_config_t *config);

/*! @brief  Deinit the Main PLL.
 *  @param  none.
 */
static inline void CLOCK_DeinitMainPll(void)
{
    /* Set Main PLL Reset & HOLDRING_OFF_ENA */
    CLKCTL2->MAINPLL0CTL0 |= CLKCTL2_MAINPLL0CTL0_HOLD_RING_OFF_ENA_MASK | CLKCTL2_MAINPLL0CTL0_RESET_MASK;
    /* Power down Main PLL*/
#if defined(FSL_CLOCK_DRIVER_COMPUTE) || defined(FSL_CLOCK_DRIVER_MEDIA)
    SLEEPCON0->RUNCFG_SET = SLEEPCON0_RUNCFG_PLLLDO_PD_MASK | SLEEPCON0_RUNCFG_PLLANA_PD_MASK;
#else
    SLEEPCON1->RUNCFG_SET = SLEEPCON1_RUNCFG_PLLLDO_PD_MASK | SLEEPCON1_RUNCFG_PLLANA_PD_MASK;
#endif
}
/*! @brief Initialize the Main PLL PFD.
 *  @param pfd    : Which PFD clock to enable.
 *  @param divider    : The PFD divider value.
 *  @return kStatus_Success if successfully, kStatus_Timeout if timeout happen.
 *  @note It is recommended that PFD settings are kept between 12-35.
 */
status_t CLOCK_InitMainPfd(clock_pfd_t pfd, uint8_t divider);

