zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT798S/drivers/fsl_clock.h
/*! @brief Disable the Main PLL PFD.
 *  @param pfd    : Which PFD clock to disable.
 */
static inline void CLOCK_DeinitMainPfd(clock_pfd_t pfd)
{
    assert(pfd <= kCLOCK_Pfd3);
    CLKCTL2->MAINPLL0PFD |= ((uint32_t)CLKCTL2_AUDIOPLL0PFD_PFD0_CLKGATE_MASK << (8UL * (uint32_t)pfd));
}

/*! @brief  Initialize the audio PLL.
 *  @param  config    : Configuration to set to PLL.
 */
void CLOCK_InitAudioPll(const clock_audio_pll_config_t *config);

/*! @brief  Deinit the Audio PLL.
 *  @param  none.
 */
static inline void CLOCK_DeinitAudioPll(void)
{
    /* Set Audio PLL Reset & HOLDRINGOFF_ENA */
    CLKCTL2->AUDIOPLL0CTL0 |= CLKCTL2_AUDIOPLL0CTL0_HOLD_RING_OFF_ENA_MASK | CLKCTL2_AUDIOPLL0CTL0_RESET_MASK;
    /* Power down Audio PLL */
#if defined(FSL_CLOCK_DRIVER_COMPUTE) || defined(FSL_CLOCK_DRIVER_MEDIA)
    /* Power down Audio PLL before change fractional settings */
    SLEEPCON0->RUNCFG_SET = SLEEPCON0_RUNCFG_AUDPLLLDO_PD_MASK | SLEEPCON0_RUNCFG_AUDPLLANA_PD_MASK;
#else
    SLEEPCON1->RUNCFG_SET = SLEEPCON1_RUNCFG_AUDPLLLDO_PD_MASK | SLEEPCON1_RUNCFG_AUDPLLANA_PD_MASK;
#endif
}

/*! @brief Initialize the audio PLL PFD.
 *  @param pfd    : Which PFD clock to enable.
 *  @param divider    : The PFD divider value.
 *  @return kStatus_Success if successfully, kStatus_Timeout if timeout happen.
 *  @note It is recommended that PFD settings are kept between 12-35.
 */
status_t CLOCK_InitAudioPfd(clock_pfd_t pfd, uint8_t divider);
/*! @brief Disable the audio PLL PFD.
 *  @param pfd    : Which PFD clock to disable.
 */
static inline void CLOCK_DeinitAudioPfd(clock_pfd_t pfd)
{
    assert(pfd <= kCLOCK_Pfd3);
    CLKCTL2->AUDIOPLL0PFD |= ((uint32_t)CLKCTL2_AUDIOPLL0PFD_PFD0_CLKGATE_MASK << (8UL * (uint32_t)pfd));
}

/*! @brief  Return Frequency of Lower power osc
 *  @return Frequency of LPOSC
 */
static inline uint32_t CLOCK_GetLpOscFreq(void)
{
    return CLK_LPOSC_1MHZ;
}

/*! @brief  Return Frequency of sys osc Clock
 *  @return Frequency of sys osc Clock. Or CLK_IN pin frequency.
 */
static inline uint32_t CLOCK_GetSysOscFreq(void)
{
    return (CLKCTL2->SYSOSCBYPASS == 0U) ? g_xtalFreq : ((CLKCTL2->SYSOSCBYPASS == 1U) ? g_clkinFreq : 0U);
}

/*! @brief  Return Frequency of MCLK Input Clock
 *  @return Frequency of MCLK input Clock.
 */
static inline uint32_t CLOCK_GetMclkInClkFreq(void)
{
    return g_mclkFreq;
}

/*! @brief  Return Frequency of 32kHz osc
 *  @return Frequency of 32kHz osc
 */
uint32_t CLOCK_GetOsc32KFreq(void);

/*! @brief  Enables OSC32KNP
 *  @param  config : configuration set to OSC32KNP
 */
void CLOCK_EnableOsc32K(clock_osc32k_config_t *config);

/*! @brief  Disable OSC32KNP
 */
static inline void CLOCK_DisableOsc32K(void)
{
    OSC32KNP->CTRL |= OSC32KNP_CTRL_OSC_DIS_MASK;
}

/*! @brief  Return Frequency of 32khz wake clk
 *  @return Frequency of 32kHz wake clk
 */
uint32_t CLOCK_GetWakeClk32KFreq(void);

/*!
 * @brief Set the XTALIN (system OSC) frequency based on board setting.
 * NOTE, when SOSC is used, either CLOCK_SetXtalFreq or CLOCK_SetClkinFreq(But NOT both.) should be called to tell
 * driver the clock frequency connected to SOSC module.
 *
 * @param freq : The XTAL input clock frequency in Hz.
 */
static inline void CLOCK_SetXtalFreq(uint32_t freq)
{
    g_xtalFreq  = freq;
    g_clkinFreq = 0U;
}

/*!
 * @brief Set the CLKIN (CLKIN pin) frequency based on board setting.
 *
 * @param freq : The CLK_IN pin input clock frequency in Hz.
 */
static inline void CLOCK_SetClkinFreq(uint32_t freq)
{
    g_clkinFreq = freq;
    g_xtalFreq  = 0U;
}

/*!
 * @brief Set the 32KHz external input frequency based on board setting.
 *
 * @param freq : The 32KHz external pin input clock frequency in Hz.
 */
static inline void CLOCK_Set32kClkinFreq(uint32_t freq)
{
    g_32kClkinFreq = freq;
}

/*!
 * @brief Set the MCLK IN frequency based on board setting.
 *
 * @param freq : The MCLK input clock frequency in Hz.
 */
static inline void CLOCK_SetMclkFreq(uint32_t freq)
{
    g_mclkFreq = freq;
}

/*! @brief  Return Frequency of Core/system clock
 *  @return Frequency of core or system Clock
 */
static inline uint32_t CLOCK_GetCoreSysClkFreq(void)
{
    return CLOCK_GetFreq(kCLOCK_CoreSysClk);
}

/*! @brief  Return Frequency of XSPI function clock
 *  @param  id : XSPI index to get frequency.
 *  @return Frequency of XSPI functional Clock
 */
uint32_t CLOCK_GetXspiClkFreq(uint32_t id);

/*! @brief  Return Frequency of UTICK function clock
 *  @return Frequency of UTICK functional Clock
 */
uint32_t CLOCK_GetUtickClkFreq(void);

/*! @brief  Return Frequency of systick clk
 *  @return Frequency of systick clk
 */
uint32_t CLOCK_GetSystickClkFreq(void);

/*! @brief  Return Frequency of WDT clk
 *  @param  id : WDT index to get frequency.
 *  @return Frequency of WDT clk
 */
uint32_t CLOCK_GetWdtClkFreq(uint32_t id);

/*! @brief  Return Frequency of ACMP clk
 *  @return Frequency of ACMP clk
 */
uint32_t CLOCK_GetAcmpClkFreq(void);

/*! @brief  Return Frequency of SAI clk
 *  @return Frequency of SAI clk
 */
uint32_t CLOCK_GetSaiClkFreq(void);

/*! @brief  Return Frequency of USB clk
 *  @return Frequency of USB clk
 */
uint32_t CLOCK_GetUsbClkFreq(void);

/*! @brief  Return Frequency of I3C clk
 *  @return Frequency of I3C clk
 */
uint32_t CLOCK_GetI3cClkFreq(void);

/*! @brief  Return Frequency of Flexcomm functional Clock
 *  @param  id : flexcomm index to get frequency.
 *  @return Frequency of Flexcomm functional Clock
 */
uint32_t CLOCK_GetLPFlexCommClkFreq(uint32_t id);

/*! @brief  Return Frequency of LPI2C functional Clock
 *  @param  id : LPI2C index to get frequency.
 *  @return Frequency of LPI2C functional Clock
 */
uint32_t CLOCK_GetLPI2cClkFreq(uint32_t id);

/*! @brief  Return Frequency of LPSPI functional Clock
 *  @param  id : LPSPI index to get frequency.
 *  @return Frequency of LPSPI functional Clock
 */
uint32_t CLOCK_GetLPSpiClkFreq(uint32_t id);

/*! @brief  Return Frequency of Flexio functional Clock
 *  @return Frequency of Flexcomm functional Clock
 */
uint32_t CLOCK_GetFlexioClkFreq(void);

/*! @brief  Return Frequency of OSTIMER functional Clock
 *  @return Frequency of OSTIMER functional Clock
 */
uint32_t CLOCK_GetOSTimerClkFreq(void);

